# Entry-Level Automation Engineer Live Coding Assessment

## Instructions:
- This test has **2 tasks**, each designed to be completed in **~30 minutes**.
- Use Python (you may import any standard library like `pandas`, `json`, etc.)
- You can test your solution in this notebook.
- Submit this notebook after completion.

---

### âœ… Task 1: Python Dictionary Filter

Write a Python function that filters a list of dictionaries and returns only those that have **all the required keys**.

#### Function Signature:
```python
def filter_dicts(data: list[dict], required_keys: list[str]) -> list[dict]:
    pass
```

#### Example Input:
```python
data = [
    {"name": "Alice", "age": 25},
    {"name": "Bob"},
    {"name": "Charlie", "age": 30, "city": "Mumbai"}
]

required_keys = ["name", "age"]
```

#### Expected Output:
```python
[
    {"name": "Alice", "age": 25},
    {"name": "Charlie", "age": 30, "city": "Mumbai"}
]
```

ðŸ‘‰ Implement your code below:

In [34]:
## Task 1 solution
def filter_dicts(data: list[dict], required_keys: list[str]) -> list[dict]:
    filter = []
    for item in data:
        if all(k in item for k in required_keys):
            filter.append(item)
    return filter

required_keys = ["name", "age"]

data = [
    {"name": "Alice", "age": 25},
    {"name": "Bob"},
    {"name": "Charlie", "age": 30, "city": "Mumbai"}
]

output = filter_dicts(data, required_keys)
print(output)

[{'name': 'Alice', 'age': 25}, {'name': 'Charlie', 'age': 30, 'city': 'Mumbai'}]

### âœ… Task 2: Pandas â€“ Clean a CSV File

You are given a CSV file named `students.csv` (attached separately).

Your task is to write a script that:
1. Reads the CSV using Pandas  
2. Strips extra spaces in column names  
3. Removes duplicate rows  
4. Drops rows where any value is missing  
5. Prints the cleaned DataFrame and row counts before and after cleaning  
6. Saves the cleaned file as `clean_students.csv`

ðŸ‘‰ Implement your code below:

In [13]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [15]:
# Task 2 solution
df = pd.read_csv('students.csv') #Used Pandas to read the csv file into datafrane

In [16]:
df.head() #Top 5 rows of the csv file, to understand the data

     Name     Age       City
0    Julia      21  Hyderabad
1    Julia      21  Hyderabad
2    Grace  twenty    Kolkata
3  Charlie      22     Mumbai
4    Julia      21    Kolkata

In [37]:
print("Size of data : ")
df.shape

Size of data :

(71, 3)

In [36]:
# To get to know the data types of column
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 71 entries, 0 to 97
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0    Name   71 non-null     object
 1    Age    71 non-null     object
 2    City   71 non-null     object
dtypes: object(3)
memory usage: 2.2+ KB

In [38]:
print('Summary of the Dataset : ')
df.describe()

Summary of the Dataset :

         Name  Age     City
count       71   71       71
unique      10    5        6
top     Hannah   23  Chennai
freq        10   17       14

In [21]:
df.duplicated().sum()   #to find the duplicates

np.int64(14)

In [22]:
df.drop_duplicates(inplace = True)   #removing all the duplicates using dropna

In [23]:
df.duplicated().sum()

np.int64(0)

In [24]:
df.isnull().sum()   # to find the missing values

Name      0
Age      15
City      0
dtype: int64

In [25]:
df = df.dropna()   #doing the same, as in duplicated to remove the missing values

In [26]:
df.isnull().sum()   #to check there are still missing values are not

Name     0
Age      0
City     0
dtype: int64

In [39]:
df.shape   #shape of the dataset after deleting rows and columns

(71, 3)

In [40]:
df.tail()

      Name  Age       City
90      Bob   21  Bangalore
91    Frank   22  Bangalore
92    Grace   22    Chennai
95  Charlie   20    Chennai
97    David   21      Delhi

In [41]:
df

      Name     Age       City
0     Julia      21  Hyderabad
2     Grace  twenty    Kolkata
3   Charlie      22     Mumbai
4     Julia      21    Kolkata
5     Grace      23      Delhi
..      ...     ...        ...
90      Bob      21  Bangalore
91    Frank      22  Bangalore
92    Grace      22    Chennai
95  Charlie      20    Chennai
97    David      21      Delhi

[71 rows x 3 columns]

In [42]:
df.to_csv("clean_students.csv", index=False)

### ðŸ“© Submission
Please **rename this notebook to your full name**, e.g., `YourName_LiveCoding.ipynb`, and submit it **along with** the generated `clean_students.csv` file.